my_first_rails/app/controllers/calendars_controller.rb

  def weekly_schedule
    render json: Section.all.order(:weekday)
---
SELECT "sections".* FROM "sections" ORDER BY "sections"."weekday" ASC